export const PLUGA_OPTIONS = [
  'הבשור',
  'רמון',
  'תמר',
  'צין',
  'פארן',
] as const;

export const TEAM_OPTIONS = {
  'הבשור': ['צוות ביתן', 'צוות גולדמן', 'צוות לוי', 'צוות אלמנך', 'צוות וינשטיין'],
  'פארן': ['צוות טגאי', 'צוות דוד', 'צוות גוהר', 'צוות פסטרנק'],
  'תמר': ['צוות חסיד', 'צוות רונן', 'צוות מימון', 'צוות קוביליו'],
  'צין': ['צוות הלאלי', 'צוות להר', 'צוות אסולין', 'צוות טורפיאלי', 'צוות תבקה', 'צוות שור'],
  'רמון': ['צוות גולדברג', 'צוות צימליכמן', 'צוות נבו', 'צוות אזולאי', 'צוות אוסטרוב', 'צוות פלג'],
} as const;

export type Pluga = typeof PLUGA_OPTIONS[number];
export type Team = typeof TEAM_OPTIONS[Pluga][number]; 